In [32]:
import pandas as pd
import numpy as np
import pymysql
import sqlalchemy as alch
import os
from dotenv import load_dotenv
from getpass import getpass

### **EXPLORATION** ###

In [33]:
password = getpass()
dbName = "actors_actresses"
connectionData=f"mysql+pymysql://root:{password}@localhost/{dbName}"
engine = alch.create_engine(connectionData)

1. What are the top 5 best rated genres?

In [36]:
query = '''SELECT Genre, ROUND(AVG(Rating),2) as Average_Rating
            FROM (
                SELECT Genre_1 as Genre, Rating FROM imdb WHERE Genre_1 IS NOT NULL AND Genre_1 != ''
                UNION ALL
                SELECT Genre_2, Rating FROM imdb WHERE Genre_2 IS NOT NULL AND Genre_2 != ''
                UNION ALL
                SELECT Genre_3, Rating FROM imdb WHERE Genre_3 IS NOT NULL AND Genre_3 != ''
            ) as genres_combined
            GROUP BY genre
            ORDER BY Average_Rating DESC
            LIMIT 5;'''
pd.read_sql_query(query, engine)

       Genre  Average_Rating
0        War            7.37
1  Animation            7.33
2  Biography            7.30
3      Music            7.14
4    History            7.12

2. Which are the most repeated genres?

    IMDB

In [ ]:
query = '''SELECT genre, COUNT(*) as genre_count
        FROM (
            SELECT Genre_1 as genre FROM imdb
            UNION ALL
            SELECT Genre_2 FROM imdb
            UNION ALL
            SELECT Genre_3 FROM imdb
            ) as genres_combined
        WHERE genre IS NOT NULL AND genre != ''
        GROUP BY genre
        ORDER BY genre_count DESC
        LIMIT 5;'''
pd.read_sql_query(query, engine)

       genre  genre_count
0      Drama         1870
1     Action         1114
2     Comedy         1026
3  Adventure          949
4   Thriller          710

    AMAZON

In [ ]:
query = '''SELECT genre, COUNT(*) as genre_count
        FROM (
            SELECT Genre_1 as genre FROM amazon
            UNION ALL
            SELECT Genre_2 FROM amazon
            ) as genres_combined
        WHERE genre IS NOT NULL AND genre != ''
        GROUP BY genre
        ORDER BY genre_count DESC
        LIMIT 5;'''
pd.read_sql_query(query, engine)

      genre  genre_count
0     Drama        20082
1    Comedy        10239
2    Action         9086
3  Suspense         5780
4    Horror         4113

    NETFLIX

In [ ]:
query = '''SELECT genre, COUNT(*) as genre_count
        FROM (
            SELECT Genre_1 as genre FROM netflix
            UNION ALL
            SELECT Genre_2 FROM netflix
            UNION ALL
            SELECT Genre_3 FROM netflix
            ) as genres_combined
        WHERE genre IS NOT NULL AND genre != ''
        GROUP BY genre
        ORDER BY genre_count DESC
        LIMIT 5;'''
pd.read_sql_query(query, engine)

                   genre  genre_count
0   International Movies        19763
1                 Dramas        13467
2               Comedies        10789
3     Action & Adventure         8060
4                 Dramas         7311

As we can see the most repeated 3 genres are Drama, Comedy and Action/Adventure if you count them together.

Even though they are not the most best rated, they are the most produced, so why's that? Does it have something to do with the revenue?

3. Revenue / Genres

In [58]:
query = '''SELECT Genre, SUM(CAST(`Revenue (Millions)` AS DECIMAL(10,2)))/COUNT(DISTINCT Title) as Total_Revenue_Millions
        FROM (
            SELECT Genre_1 as Genre, `Revenue (Millions)`, Title FROM imdb WHERE Genre_1 IS NOT NULL AND Genre_1 != ''
            UNION ALL
            SELECT Genre_2, `Revenue (Millions)`, Title FROM imdb WHERE Genre_2 IS NOT NULL AND Genre_2 != ''
            UNION ALL
            SELECT Genre_3, `Revenue (Millions)`, Title FROM imdb WHERE Genre_3 IS NOT NULL AND Genre_3 != ''
        ) as genres_combined
        GROUP BY genre
        ORDER BY Total_Revenue_Millions DESC
        LIMIT 5;'''
pd.read_sql_query(query, engine)

       Genre  Total_Revenue_Millions
0  Animation              682.663673
1  Adventure              556.536062
2     Sci-Fi              453.249250
3    Fantasy              448.228713
4     Family              437.374118

Okay, the answer is no. Maybe it's because they cost way less to produce, although we don't have the data to prove that hypothesis.

4. Who are the most active actors/actresses?

    IMDB

In [41]:
query = '''SELECT Actors, COUNT(Actors) AS films_shows
        FROM imdb
        WHERE Actors IS NOT NULL AND Actors != ''
        GROUP BY Actors
        ORDER BY films_shows DESC
        LIMIT 10;'''
pd.read_sql_query(query, engine)

               Actors  films_shows
0       Mark Wahlberg           15
1      Christian Bale           13
2        Hugh Jackman           13
3           Brad Pitt           13
4           Tom Hardy           12
5  Michael Fassbender           12
6     Jake Gyllenhaal           11
7   Robert Downey Jr.           11
8      Channing Tatum           11
9         Johnny Depp           11

    AMAZON

In [43]:
query = '''SELECT cast, COUNT(cast) AS films_shows
        FROM amazon
        WHERE cast !=1 AND cast != ''
        GROUP BY cast
        ORDER BY films_shows DESC
        LIMIT 10;'''
pd.read_sql_query(query, engine)

                 cast  films_shows
0      Maggie Binkley           56
1          Gene Autry           32
2              Nassar           30
3            Champion           29
4  Anne-Marie Newland           25
5         Prakash Raj           25
6          Roy Rogers           23
7          John Wayne           23
8         Danny Trejo           22
9  Cassandra Peterson           22

    NETFLIX

In [46]:
query = '''SELECT cast, COUNT(cast) AS films_shows
        FROM netflix
        WHERE cast IS NOT NULL AND cast != ''
        GROUP BY cast
        ORDER BY films_shows DESC
        LIMIT 5;'''
pd.read_sql_query(query, engine)

               cast  films_shows
0       Anupam Kher           43
1    Shah Rukh Khan           35
2     Julie Tejwani           33
3  Naseeruddin Shah           32
4  Takahiro Sakurai           32

We've seen the most active actors, let's see if there's a correlation with more active actors and being better at acting.

5. Are the most active actors the most awarded actors also?

    Best_Act

In [74]:
query = '''SELECT Name, SUM(Oscars + BAFTA + `Golden Globes`) AS Count_Awards
        FROM (
        SELECT DISTINCT Name, Oscars, BAFTA, `Golden Globes`
        FROM best_act
        WHERE Oscars IS NOT NULL AND Oscars != '' AND BAFTA IS NOT NULL AND BAFTA != '' AND `Golden Globes` IS NOT NULL AND `Golden Globes` != ''
        ) AS unique_awards
        GROUP BY Name
        ORDER BY Count_Awards DESC
        LIMIT 15;'''
pd.read_sql_query(query, engine)

                Name  Count_Awards
0        Woody Allen          15.0
1     Jack Nicholson          13.0
2     Dustin Hoffman          11.0
3   Daniel Day-Lewis           9.0
4        Jack Lemmon           8.0
5       Gene Hackman           8.0
6          Al Pacino           7.0
7      Marlon Brando           7.0
8        Peter Finch           7.0
9      Robert Duvall           6.0
10    Robert Redford           6.0
11     Javier Bardem           6.0
12   Christoph Waltz           6.0
13     Geoffrey Rush           6.0
14     Michael Caine           6.0

    Award

In [64]:
query = '''SELECT Name, SUM(Winner) AS Count_Awards
        FROM award
        WHERE Winner IS NOT NULL AND Winner != '' 
        GROUP BY Name
        ORDER BY Count_Awards DESC
        LIMIT 10;'''
pd.read_sql_query(query, engine)

                Name  Count_Awards
0  Katharine Hepburn           4.0
1     Jack Nicholson           3.0
2     Walter Brennan           3.0
3       Meryl Streep           3.0
4     Ingrid Bergman           3.0
5        Helen Hayes           2.0
6          Sean Penn           2.0
7        Bette Davis           2.0
8       Luise Rainer           2.0
9       Vivien Leigh           2.0

The answer is no. Maybe because they filter more in which films they work.

6. Where are this actors from?

In [79]:
query = '''SELECT Name, SUM(Oscars + BAFTA + `Golden Globes`) AS Count_Awards, City, Country
        FROM (
        SELECT DISTINCT Name, Oscars, BAFTA, `Golden Globes`, City, Country
        FROM best_act
        WHERE Oscars IS NOT NULL AND Oscars != '' AND BAFTA IS NOT NULL AND BAFTA != '' AND `Golden Globes` IS NOT NULL AND `Golden Globes` != ''
        ) AS unique_awards
        GROUP BY Name, City, Country
        ORDER BY Count_Awards DESC
        LIMIT 15;'''
pd.read_sql_query(query, engine)

#Ups... Information a bit mistaken but...

                Name  Count_Awards            City         Country
0        Woody Allen          15.0
1     Jack Nicholson          13.0      New Jersey   United States
2     Dustin Hoffman          11.0      California   United States
3   Daniel Day-Lewis           9.0          London  United Kingdom
4        Jack Lemmon           8.0   Massachusetts   United States
5       Gene Hackman           8.0      California   United States
6          Al Pacino           7.0        New York   United States
7      Marlon Brando           7.0        Nebraska   United States
8        Peter Finch           7.0          London  United Kingdom
9      Robert Duvall           6.0      California   United States
10    Robert Redford           6.0      California   United States
11     Javier Bardem           6.0           Spain
12   Christoph Waltz           6.0         Austria
13     Geoffrey Rush           6.0       Australia
14     Michael Caine           6.0  United Kingdom

In [82]:
query = '''SELECT City, Country, COUNT(City), COUNT(Country)
        FROM (
        SELECT DISTINCT Name, City, Country
        FROM best_act
        ) AS unique_awards
        GROUP BY Country, City
        ORDER BY COUNT(Country) DESC
        LIMIT 15;'''
pd.read_sql_query(query, engine)

              City         Country  COUNT(City)  COUNT(Country)
0   United Kingdom                           15              15
1         New York   United States           14              14
2       California   United States           11              11
3         Illinois   United States            6               6
4           London  United Kingdom            5               5
5       New Jersey   United States            5               5
6        Australia                            3               3
7    Massachusetts   United States            3               3
8             Ohio   United States            3               3
9            Texas   United States            3               3
10          Canada                            2               2
11       Wisconsin   United States            2               2
12    Pennsylvania   United States            2               2
13        Missouri   United States            2               2
14         Indiana   United States            2               2

7. What's the country that produces more films?

    NETFLIX

In [88]:
query = '''SELECT genre, COUNT(*) as genre_count
        FROM (
            SELECT Genre_1 as genre FROM amazon
            UNION ALL
            SELECT Genre_2 FROM amazon
            ) as genres_combined
        WHERE genre IS NOT NULL AND genre != ''
        GROUP BY genre
        ORDER BY genre_count DESC
        LIMIT 5;'''
pd.read_sql_query(query, engine)

OperationalError: (pymysql.err.OperationalError) (2006, "MySQL server has gone away (BrokenPipeError(32, 'Broken pipe'))")
[SQL: SELECT genre, COUNT(*) as genre_count
        FROM (
            SELECT Genre_1 as genre FROM amazon
            UNION ALL
            SELECT Genre_2 FROM amazon
            ) as genres_combined
        WHERE genre IS NOT NULL AND genre != ''
        GROUP BY genre
        ORDER BY genre_count DESC
        LIMIT 5;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

    AMAZON

In [78]:
query = '''SELECT country, COUNT(DISTINCT Title) as number_of_films
        FROM amazon
        WHERE country IS NOT NULL AND country != ''
        GROUP BY country
        ORDER BY number_of_films DESC
        LIMIT 10;'''
pd.read_sql_query(query, engine)

                         country  number_of_films
0                  United States              253
1                          India              229
2                 United Kingdom               28
3                         Canada               16
4  United Kingdom, United States               12
5                          Italy                8
6                          Spain                8
7          Canada, United States                7
8  United States, United Kingdom                6
9                        Germany                5

Hands down, United States. Maybe that's why more of the actors are from there.

8. How is the film industry evolving? Are more films done now than before?

    IMDB

In [83]:
query = '''SELECT Year, COUNT(DISTINCT Title) as number_of_films
        FROM imdb
        WHERE Year IS NOT NULL AND Year != ''
        GROUP BY Year
        ORDER BY Year DESC;'''
pd.read_sql_query(query, engine)

    Year  number_of_films
0   2016              297
1   2015              127
2   2014               98
3   2013               91
4   2012               64
5   2011               63
6   2010               60
7   2009               51
8   2008               52
9   2007               53
10  2006               44

    AMAZON

In [84]:
query = '''SELECT release_year, COUNT(DISTINCT Title) as number_of_films
        FROM amazon
        WHERE release_year IS NOT NULL AND release_year != ''
        GROUP BY release_year
        ORDER BY release_year DESC;'''
pd.read_sql_query(query, engine)

    release_year  number_of_films
0           2021             1441
1           2020              961
2           2019              929
3           2018              623
4           2017              562
..           ...              ...
95          1925                8
96          1924                1
97          1923                1
98          1922                2
99          1920                3

[100 rows x 2 columns]

    NETFLIX

In [87]:
query = '''SELECT release_year, COUNT(DISTINCT title) as number_of_films
        FROM netflix
        WHERE release_year IS NOT NULL AND release_year != ''
        GROUP BY release_year
        ORDER BY release_year DESC
        LIMIT 15;'''
pd.read_sql_query(query, engine)

    release_year  number_of_films
0           2021              592
1           2020              953
2           2019             1030
3           2018             1146
4           2017             1031
5           2016              902
6           2015              560
7           2014              352
8           2013              288
9           2012              237
10          2011              185
11          2010              193
12          2009              152
13          2008              136
14          2007               88

Yes, in general.